In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('C:/Users/Lenovo/OneDrive/Desktop/LIBRARIES/PANDAS/WORKING MODULES/survey_results_public.csv')
schema_df = pd.read_csv('C:/Users/Lenovo/OneDrive/Desktop/LIBRARIES/PANDAS/WORKING MODULES/survey_results_schema.csv')

In [18]:
people = {
    'name':['Rahul','Surbhi','Ekta'],
    'last':['Gupta','Bhandari','Sadana'],
    'email':['rahul.gupta@gmail.com','surbhi.bhandari@gmail.com','ekta.sadana@gmail.com']
}

people_df = pd.DataFrame(people)

In [4]:
pd.set_option('display.max_rows',85)
pd.set_option('display.max_columns',85)

In [7]:
df.set_index('Respondent', inplace=True)

In [10]:
schema_df.set_index('Column', inplace = True)

In [16]:
# df['ConvertedComp'].median()
# df['ConvertedComp'].mode()
df['ConvertedComp'].mean()

127110.73842323056

In [17]:
df.describe()

          CompTotal  ConvertedComp   WorkWeekHrs    CodeRevHrs           Age
count  5.594500e+04   5.582300e+04  64503.000000  49790.000000  79210.000000
mean   5.519014e+11   1.271107e+05     42.127197      5.084308     30.336699
std    7.331926e+13   2.841523e+05     37.287610      5.513931      9.178390
min    0.000000e+00   0.000000e+00      1.000000      0.000000      1.000000
25%    2.000000e+04   2.577750e+04     40.000000      2.000000     24.000000
50%    6.200000e+04   5.728700e+04     40.000000      4.000000     29.000000
75%    1.200000e+05   1.000000e+05     44.750000      6.000000     35.000000
max    1.000000e+16   2.000000e+06   4850.000000     99.000000     99.000000

In [22]:
df['Country'].value_counts()
# df['Country'].value_counts(normalize=True)

United States        20949
India                 9061
Germany               5866
United Kingdom        5737
Canada                3395
                     ...
Tonga                    1
Timor-Leste              1
North Korea              1
Brunei Darussalam        1
Chad                     1
Name: Country, Length: 179, dtype: int64

In [23]:
people_df

     name      last                      email
0   Rahul     Gupta      rahul.gupta@gmail.com
1  Surbhi  Bhandari  surbhi.bhandari@gmail.com
2    Ekta    Sadana      ekta.sadana@gmail.com

In [35]:
people_df['name'].replace({"Rahul":"Roghan"},inplace = True)

In [38]:
people_df.set_index('name',inplace = True)

In [46]:
people_df

       last                      email
0     Gupta      rahul.gupta@gmail.com
1  Bhandari  surbhi.bhandari@gmail.com
2    Sadana      ekta.sadana@gmail.com
3     Tanna            tanna@gmail.com

In [44]:
#appending a row

people_df = people_df.append({'last':'Tanna','email':'tanna@gmail.com'}, ignore_index=True)

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_7028\3042965090.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  people_df = people_df.append({'last':'Tanna','email':'tanna@gmail.com'}, ignore_index=True)

In [45]:
people_df

       last                      email
0     Gupta      rahul.gupta@gmail.com
1  Bhandari  surbhi.bhandari@gmail.com
2    Sadana      ekta.sadana@gmail.com
3     Tanna            tanna@gmail.com

In [47]:
people_df['name'] = ['Rahul','Ekta','Surbhi', 'Karishma']

In [48]:
people_df

       last                      email      name
0     Gupta      rahul.gupta@gmail.com     Rahul
1  Bhandari  surbhi.bhandari@gmail.com      Ekta
2    Sadana      ekta.sadana@gmail.com    Surbhi
3     Tanna            tanna@gmail.com  Karishma

In [50]:
last_column = people_df.pop('name')

In [51]:
last_column

0       Rahul
1        Ekta
2      Surbhi
3    Karishma
Name: name, dtype: object

In [53]:
people_df.insert(0,'NAME',last_column)

In [57]:
people_df.set_index('NAME', inplace  = True)

In [58]:
people_df

              last                      email
NAME
Rahul        Gupta      rahul.gupta@gmail.com
Ekta      Bhandari  surbhi.bhandari@gmail.com
Surbhi      Sadana      ekta.sadana@gmail.com
Karishma     Tanna            tanna@gmail.com

In [60]:
country_df = df.groupby(['Country'])

In [70]:
#getting data from a single country


country_df['SocialMedia'].value_counts().head(3)
# country_df['ConvertedComp'].value_counts().loc['India']

Country      SocialMedia
Afghanistan  Facebook                    15
             YouTube                      9
             I don't use social media     6
Name: SocialMedia, dtype: int64

In [74]:
country_df['ConvertedComp'].agg(['mean','median']).loc['Germany']

mean      109256.884066
median     63016.000000
Name: Germany, dtype: float64

In [134]:
total_respondents = df['Country'].value_counts()  #checking the total number of respondents from each country

In [135]:
total_respondents

United States        20949
India                 9061
Germany               5866
United Kingdom        5737
Canada                3395
                     ...
Tonga                    1
Timor-Leste              1
North Korea              1
Brunei Darussalam        1
Chad                     1
Name: Country, Length: 179, dtype: int64

In [145]:
def my_func(x):
    return x.str.contains('Python').sum()


country_uses_python = country_df['LanguageWorkedWith'].apply(my_func)

In [143]:
check_df = pd.concat([country_uses_python,total_respondents], axis = 'columns')

                                      LanguageWorkedWith  Country
Afghanistan                                            8       44
Albania                                               23       86
Algeria                                               40      134
Andorra                                                0        7
Angola                                                 2        5
...                                                  ...      ...
Venezuela, Bolivarian Republic of...                  28       88
Viet Nam                                              78      231
Yemen                                                  3       19
Zambia                                                 4       12
Zimbabwe                                              14       39

[179 rows x 2 columns]